VV_cases/V1_solver/results/study_v1/runs/001_data_beta05_initial_verification/02_simulations/long_medium_Re120/01_openfoam_setup/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     pimpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         12.000;
deltaT          5e-4;
adjustTimeStep  yes;
maxCo           0.6;
writeControl    runTime;
writeInterval   0.2;
purgeWrite      0;
writeFormat     ascii;
writePrecision  10;
writeCompression off;
timeFormat      general;
timePrecision   12;
runTimeModifiable true;

functions
{
    forceCoeffs
    {
        type forceCoeffs;
        libs (forces);
        executeControl timeStep;
        executeInterval 1;
        writeControl timeStep;
        writeInterval 1;
        log yes;
        patches (cylinder);
        rho rhoInf;
        rhoInf 1.205000;
        CofR (0 0 0);
        liftDir (0 1 0);
        dragDir (1 0 0);
        pitchAxis (0 0 1);
        magUInf 0.151600000;
        lRef 0.012000;
        Aref 0.000120000;
    }
    residuals
    {
        type solverInfo;
        libs (utilityFunctionObjects);
        fields (U p);
        writeControl timeStep;
        writeInterval 1;
    }
    CourantNo
    {
        type CourantNo;
        libs (fieldFunctionObjects);
        writeControl writeTime;
    }
}
